# pandas

In [3]:
import pandas as pd
nume = pd.Series(range(500))
nume

0        0
1        1
2        2
3        3
4        4
      ...
495    495
496    496
497    497
498    498
499    499
Length: 500, dtype: int64

### 일부 보기

In [5]:
nume.head(5)
nume.tail(5)

495    495
496    496
497    497
498    498
499    499
dtype: int64

In [8]:
import numpy as np
nums = pd.Series([1,2,np.nan,4,5])
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [128]:
hello = pd.Series(list('hello'))
hello.nunique() # 중복 제거하고 개수

4

### 수치적 통계

In [14]:
print(nums.count()) # 결측값 제외하고 출력 
print(len(nums)) 
print(nums.sum())

4
5
12.0

In [20]:
print(nums.mean())
print(nums.median())
print(nums.std())
print(nums.max())
print(nums.min())

print('')

print(nums.describe())

3.0
3.0
1.8257418583505538
5.0
1.0

count    4.000000
mean     3.000000
std      1.825742
min      1.000000
25%      1.750000
50%      3.000000
75%      4.250000
max      5.000000
dtype: float64

In [18]:
somechar = pd.Series(list('AaBbCc'))
somechar.max()

'c'

### 연습문제

In [24]:
superheros=['Batman' , 'superman'] 
strength_levels=(100,120)

heros = pd.Series(data = strength_levels , index = superheros)
heros

Batman      100
superman    120
dtype: int64

In [44]:
poketmon = pd.read_csv('datas/pokemon.csv',index_col='Pokemon',squeeze=True)
poketmon # csv파일 시리즈 형태로 불러오기

C:\Users\User\AppData\Local\Temp\ipykernel_20372\2347541332.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  poketmon = pd.read_csv('datas/pokemon.csv',index_col='Pokemon',squeeze=True)

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [46]:
poketmon.sort_values() # 내림차순 정렬

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [49]:
google = pd.read_csv('datas/google_stocks.csv',parse_dates=['Date'],index_col='Date',squeeze=True)
google # 날짜/시간 데이터 파이썬 자료로 파싱

C:\Users\User\AppData\Local\Temp\ipykernel_20372\299396306.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  google = pd.read_csv('datas/google_stocks.csv',parse_dates=['Date'],index_col='Date',squeeze=True)

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [54]:
war = pd.read_csv("datas/revolutionary_war.csv",    
                  usecols=["Start Date", "State"],  #usecols는 원하는 열만 가져올 수 있음 
                  parse_dates=["Start Date"],       # start date 파싱 
                  index_col="Start Date").squeeze("columns")
war

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

### 연습문제

In [58]:
war.isnull().sum()
war.count() # 결측치를 제외한 값의 개수
war.nunique() # 유일한 값의 개수

17

In [63]:
war.sort_values(na_position='first') # 값을 기준으로 정렬(알파벳 빠른순)
war.sort_values(na_position='last') # 값을 기준으로 정렬(알파벳 느린순)
poketmon.sort_index(ascending=True) # 인덱스 기준으로 오름차순 정렬

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [60]:
war.dropna() #nan값 제외

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

### series index에 NAT 뺴고 추출

In [65]:
war.loc[war.index.dropna()] #

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-19    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 250, dtype: object

In [64]:
war.loc[war.index.notnull()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

### 연습문제

In [67]:
google.sort_values(ascending=False).head(10)
google.sort_values(ascending=True).head(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [69]:
google.nlargest(10) #큰값부터 10개 
google.nsmallest(10) #작은값부터 10개

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [73]:
poketmon.value_counts()

Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: Type, Length: 159, dtype: int64

In [78]:
bins= np.linspace(0,1400,8) # 0~1400 을 8구간으로 나옴
print(bins)
print('')
print(google.value_counts(bins=bins))

[   0.  200.  400.  600.  800. 1000. 1200. 1400.]

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

### 연습문제

In [80]:
google.value_counts(bins=bins).sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [83]:
google.value_counts(bins=8 , sort=False) # bin을 정수로 전달하면 알아서 구간 나누고 sort는 정렬 안할수도 있음

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [90]:
data = {'c1':[1,2,'누락'] , 'c2':[1.11,'',3.33],'c3':['one','two','three']}
columns=['c1','c2','c3']
index = [0,1,2]
df = pd.DataFrame(data,index=index,columns=columns)
df

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [93]:
df.to_csv('sample.csv',index=False) # 샘플 데이터 csv 파일 만들기 
df.to_csv('sample2.csv',index=False,header=False) #column index를 뺴는 옵션 추가해서 sample2 만듬

In [97]:
df_read = pd.read_csv('sample.csv')
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [95]:
pd.read_csv('sample2.csv',names=['c1','c2','c3'])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [99]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515
# 콤마로 구분되지 않은 텍스트 파일을 저장

Writing sample3.txt

In [100]:
pd.read_table('sample3.txt',sep='\s+') # 공백이 구분자인 경우\s+ 정규식 문자열 사용

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [101]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [102]:
pd.read_csv('sample4.txt',skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [107]:
df_na_val = pd.read_csv('sample.csv',na_values=['누락']) #누락을 NAN으로 바꿔서 가져옴 
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [108]:
df_na_val.to_csv('sample5.txt',sep='|') # 구분자를 |로 바꿈

In [115]:
df_na_val.to_csv('sample6.csv',na_rep='누락')
pd.read_csv('sample6.csv')

   Unnamed: 0   c1    c2     c3
0           0  1.0  1.11    one
1           1  2.0    누락    two
2           2   누락  3.33  three

In [114]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [124]:
df = pd.read_csv('지하철 혼잡도.csv',encoding='cp949')
df

,연번,조사일자,호선,역번호,역명,구분,5시30분,6시00분,6시30분,7시00분,...,19시00분,19시30분,20시00분,20시30분,21시00분,21시30분,22시00분,22시30분,23시00분,23시30분
0,1,평일,1,150,서울역,상선,6.2,14.6,13.4,26.8,...,20.0,15.1,11.1,12.0,12.5,10.1,10.4,16.4,7.8,6.1
1,2,평일,1,150,서울역,하선,9.1,8.6,9.3,15.2,...,37.5,26.5,25.5,26.4,26.3,21.1,32.1,20.3,12.6,10.3
2,3,평일,1,151,시청,상선,5.4,10.1,13.0,20.8,...,24.1,17.4,13.7,14.5,15.8,12.1,14.5,18.3,11.7,11.7
3,4,평일,1,151,시청,하선,7.0,6.8,10.2,14.5,...,33.8,22.9,22.0,24.1,23.0,21.0,24.8,18.5,11.8,9.1
4,5,평일,1,152,종각,상선,5.2,10.8,9.3,13.6,...,28.8,20.2,19.1,18.7,22.2,16.1,21.8,25.1,16.3,14.8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1699,1700,일요일,8,2825,신흥,하선,7.0,3.0,2.2,2.1,...,4.0,2.6,3.2,2.6,3.7,2.4,2.4,1.6,2.2,1.5
1700,1701,일요일,8,2826,수진,상선,2.4,1.5,3.2,2.2,...,4.6,4.1,3.4,4.4,4.2,4.1,3.9,3.8,2.6,1.4
1701,1702,일요일,8,2826,수진,하선,9.3,4.1,2.6,2.1,...,2.6,1.9,2.3,1.5,1.8,1.3,1.3,0.9,1.1,0.5
1702,1703,일요일,8,2827,모란,상선,1.6,0.9,2.5,1.3,...,4.7,4.2,3.7,4.8,4.1,4.0,4.0,4.2,2.7,1.8
1703,1704,일요일,8,2827,모란,하선,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0